set power_preserve_rtl_hier_names true
elaborate IIR_FILTER_ADV -arch BEHAVIOR -lib WORK > elaborate_real.txt
uniquify 
link
create_clock -name MY_CLK -period 10.16 clk
set_dont_touch_network MY_CLK
set_clock_uncertainty 0.07 [get_clocks MY_CLK]
set_input_delay 0.5 -max -clock MY_CLK [remove_from_collection [all_inputs] clk]
set_output_delay 0.5 -max -clock MY_CLK [all_outputs]
set OLOAD [load_of NangateOpenCellLibrary/BUF_X4/A]
set_load $OLOAD [all_outputs]
compile
report_timing > timing_IIR_FILTER_ADV.txt
report_area > area_IIR_FILTER_ADV.txt
ungroup -all -flatten
change_names -hierarchy -rules verilog
write_sdf /home/isa16/lab1/advanced_architecture/syn/netlist/IIR_FILTER_ADV.sdf
write -f verilog -hierarchy -output /home/isa16/lab1/advanced_architecture/syn/netlist/IIR_FILTER_ADV.v
write_sdc /home/isa16/lab1/advanced_architecture/syn/netlist/IIR_FILTER_ADV.sdc
quit
